tests/load-test.yml
#Ejecutar esta prueba de carga con el siguiente comando:npx artillery run load-test.yml
# Asegúrate de tener Artillery instalado: npm install --save-dev artillery
# Puedes instalarlo globalmente o como una dependencia de desarrollo en tu proyecto.

config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Prueba de carga inicial"
    - duration: 60
      arrivalRate: 10
      name: "Prueba de carga con más usuarios"

scenarios:
  - flow:
      - get:
          url: "/pacientes"  # Ruta corregida